Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_8 (Lambda)            (None, 480, 640, 1)       0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 118, 158, 96)      11712     
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    multiple                  0         
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 59, 79, 96)        0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 59, 79, 96)        384       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 49, 69, 256)       2973952   
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 24, 34, 256)       0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 24, 34, 256)       1024      
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 22, 32, 384)       885120    
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 11, 16, 384)       0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 11, 16, 384)       1536      
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 9, 14, 256)        884992    
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 4, 7, 256)         0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 2, 5, 96)          221280    
_________________________________________________________________
flatten_8 (Flatten)          (None, 960)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 4096)              3936256   
_________________________________________________________________
dense_17 (Dense)             (None, 1000)              4097000   
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 1001      
=================================================================
Total params: 13,014,257
Trainable params: 13,012,785
Non-trainable params: 1,472
_________________________________________________________________
