Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_7 (Lambda)            (None, 480, 640, 1)       0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 118, 158, 96)      11712     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 59, 79, 96)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 59, 79, 96)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 49, 69, 256)       2973952   
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 24, 34, 256)       0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 24, 34, 256)       0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 22, 32, 384)       885120    
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 11, 16, 384)       0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 11, 16, 384)       0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 9, 14, 256)        884992    
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 4, 7, 256)         0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 2, 5, 96)          221280    
_________________________________________________________________
flatten_7 (Flatten)          (None, 960)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 4096)              3936256   
_________________________________________________________________
dense_14 (Dense)             (None, 1000)              4097000   
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 1001      
=================================================================
Total params: 13,011,313
Trainable params: 13,011,313
Non-trainable params: 0
_________________________________________________________________
