Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_2 (Lambda)            (None, 480, 640, 1)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 118, 158, 96)      11712     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 59, 79, 96)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 13, 18, 256)       2973952   
_________________________________________________________________
flatten_2 (Flatten)          (None, 59904)             0         
_________________________________________________________________
dense_3 (Dense)              (None, 1000)              59905000  
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 1001      
=================================================================
Total params: 62,891,665
Trainable params: 62,891,665
Non-trainable params: 0
_________________________________________________________________
