Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_5 (Lambda)            (None, 480, 640, 1)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 118, 158, 96)      11712     
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    multiple                  0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 59, 79, 96)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 59, 79, 96)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 13, 18, 256)       2973952   
_________________________________________________________________
dropout_4 (Dropout)          (None, 13, 18, 256)       0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 59904)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 1000)              59905000  
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 1001      
=================================================================
Total params: 62,891,665
Trainable params: 62,891,665
Non-trainable params: 0
_________________________________________________________________
