Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_1 (Lambda)            (None, 480, 640, 1)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 118, 158, 56)      6832      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 59, 79, 56)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 261016)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 500)               130508500 
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 501       
=================================================================
Total params: 130,515,833
Trainable params: 130,515,833
Non-trainable params: 0
_________________________________________________________________
