Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_6 (Lambda)            (None, 480, 640, 1)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 118, 158, 96)      11712     
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    multiple                  0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 59, 79, 96)        0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 59, 79, 96)        384       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 13, 18, 256)       2973952   
_________________________________________________________________
batch_normalization_4 (Batch (None, 13, 18, 256)       1024      
_________________________________________________________________
flatten_6 (Flatten)          (None, 59904)             0         
_________________________________________________________________
dense_11 (Dense)             (None, 1000)              59905000  
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 1001      
=================================================================
Total params: 62,893,073
Trainable params: 62,892,369
Non-trainable params: 704
_________________________________________________________________
