Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 118, 158, 96)      11712     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 59, 79, 96)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 59, 79, 96)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 25, 35, 256)       2973952   
_________________________________________________________________
dropout_5 (Dropout)          (None, 25, 35, 256)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 23, 33, 384)       885120    
_________________________________________________________________
dropout_6 (Dropout)          (None, 23, 33, 384)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 21, 31, 384)       1327488   
_________________________________________________________________
dropout_7 (Dropout)          (None, 21, 31, 384)       0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 19, 29, 256)       884992    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 9, 14, 256)        0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 9, 14, 256)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 32256)             0         
_________________________________________________________________
dense_5 (Dense)              (None, 3000)              96771000  
_________________________________________________________________
dropout_9 (Dropout)          (None, 3000)              0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 3000)              12000     
_________________________________________________________________
dense_6 (Dense)              (None, 2000)              6002000   
_________________________________________________________________
dropout_10 (Dropout)         (None, 2000)              0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 2000)              8000      
_________________________________________________________________
dense_7 (Dense)              (None, 1000)              2001000   
_________________________________________________________________
dropout_11 (Dropout)         (None, 1000)              0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 1000)              4000      
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 1001      
=================================================================
Total params: 110,882,265
Trainable params: 110,870,265
Non-trainable params: 12,000
_________________________________________________________________
