Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_3 (Lambda)            (None, 480, 640, 1)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 118, 158, 96)      11712     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 59, 79, 96)        0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 59, 79, 96)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 49, 69, 256)       2973952   
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 24, 34, 256)       0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 24, 34, 256)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 22, 32, 384)       885120    
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 11, 16, 384)       0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 11, 16, 384)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 9, 14, 256)        884992    
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 4, 7, 256)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 2, 5, 96)          221280    
_________________________________________________________________
flatten_3 (Flatten)          (None, 960)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 4096)              3936256   
_________________________________________________________________
dense_6 (Dense)              (None, 1000)              4097000   
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 1001      
=================================================================
Total params: 13,011,313
Trainable params: 13,011,313
Non-trainable params: 0
_________________________________________________________________
