Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 118, 158, 96)      11712     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 59, 79, 96)        0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 59, 79, 96)        384       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 25, 35, 256)       2973952   
_________________________________________________________________
batch_normalization_5 (Batch (None, 25, 35, 256)       1024      
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 23, 33, 384)       885120    
_________________________________________________________________
batch_normalization_6 (Batch (None, 23, 33, 384)       1536      
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 21, 31, 384)       1327488   
_________________________________________________________________
batch_normalization_7 (Batch (None, 21, 31, 384)       1536      
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 19, 29, 256)       884992    
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 9, 14, 256)        0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 9, 14, 256)        1024      
_________________________________________________________________
flatten_2 (Flatten)          (None, 32256)             0         
_________________________________________________________________
dense_4 (Dense)              (None, 3000)              96771000  
_________________________________________________________________
batch_normalization_9 (Batch (None, 3000)              12000     
_________________________________________________________________
dense_5 (Dense)              (None, 2000)              6002000   
_________________________________________________________________
batch_normalization_10 (Batc (None, 2000)              8000      
_________________________________________________________________
dense_6 (Dense)              (None, 1000)              2001000   
_________________________________________________________________
batch_normalization_11 (Batc (None, 1000)              4000      
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 1001      
=================================================================
Total params: 110,887,769
Trainable params: 110,873,017
Non-trainable params: 14,752
_________________________________________________________________
