Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_11 (Conv2D)           (None, 118, 158, 96)      11712     
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    multiple                  0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 59, 79, 96)        0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 59, 79, 96)        384       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 25, 35, 256)       2973952   
_________________________________________________________________
batch_normalization_13 (Batc (None, 25, 35, 256)       1024      
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 23, 33, 384)       885120    
_________________________________________________________________
batch_normalization_14 (Batc (None, 23, 33, 384)       1536      
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 21, 31, 384)       1327488   
_________________________________________________________________
batch_normalization_15 (Batc (None, 21, 31, 384)       1536      
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 19, 29, 256)       884992    
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 9, 14, 256)        0         
_________________________________________________________________
batch_normalization_16 (Batc (None, 9, 14, 256)        1024      
_________________________________________________________________
flatten_3 (Flatten)          (None, 32256)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 3000)              96771000  
_________________________________________________________________
batch_normalization_17 (Batc (None, 3000)              12000     
_________________________________________________________________
dense_9 (Dense)              (None, 2000)              6002000   
_________________________________________________________________
batch_normalization_18 (Batc (None, 2000)              8000      
_________________________________________________________________
dense_10 (Dense)             (None, 1000)              2001000   
_________________________________________________________________
batch_normalization_19 (Batc (None, 1000)              4000      
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 1001      
=================================================================
Total params: 110,887,769
Trainable params: 110,873,017
Non-trainable params: 14,752
_________________________________________________________________
